# IsDrivenByDimension Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
GlobalParameter..::..IsDrivenByDimension Property
GlobalParameter Class See Also
---
Indicates whether this parameter is driven by a dimension or not.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016 Subscription Update
# Syntax
C#
---
```text
public bool IsDrivenByDimension { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsDrivenByDimension As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsDrivenByDimension {
	bool get ();
}
```

# Remarks
Only reporting parameters can be driven by dimensions. Thus, to drive a parameter by a dimension, the parameter must first be set as reporting before it is used to label the driving dimension.
Note that the value of this property is always the opposite of the IsDrivenByFormula property. It is so because a parameter of which value is evaluated by a formula cannot be driven by a dimension, and vice versa.
# See Also
GlobalParameter Class
Autodesk.Revit.DB Namespace